#Тестирование кода, который был в учебном материале по библиотеке pandas

In [2]:
import pandas as pd

countries_df = pd.DataFrame(
    data = [
        ['Англия', 56.29, 133396],
        ['Канада', 38.05, 9984670],
        ['США', 322.28, 9826630],
        ['Россия', 146.24, 17125191],
        ['Украина', 45.5, 603628],
        ['Беларусь', 9.5, 207600],
        ['Казахстан', 17.04, 2724902]
    ],
    columns= ['country', 'population', 'area'],
    index = ['UK', 'CA', 'US', 'RU', 'UA', 'BY', 'KZ']
)
display(countries_df)

      country  population      area
UK     Англия       56.29    133396
CA     Канада       38.05   9984670
US        США      322.28   9826630
RU     Россия      146.24  17125191
UA    Украина       45.50    603628
BY   Беларусь        9.50    207600
KZ  Казахстан       17.04   2724902

Работа по осям

In [3]:
mean_x = countries_df.mean(axis=0, numeric_only=True)
mean_y = countries_df.mean(axis=1, numeric_only=True)
print(mean_y, mean_x)

UK      66726.145
CA    4992354.025
US    4913476.140
RU    8562668.620
UA     301836.750
BY     103804.750
KZ    1362459.520
dtype: float64 population    9.070000e+01
area          5.800860e+06
dtype: float64

Доступ к данным в DataFrame

In [4]:
countries_df['population']

UK     56.29
CA     38.05
US    322.28
RU    146.24
UA     45.50
BY      9.50
KZ     17.04
Name: population, dtype: float64

In [5]:
countries_df.loc['UK', 'area']

np.int64(133396)

In [6]:
countries_df.loc['RU', ['population', 'area']]

population      146.24
area          17125191
Name: RU, dtype: object

In [7]:
countries_df.loc[['UA', 'BY', 'KZ'],['population', 'area']]

    population     area
UA       45.50   603628
BY        9.50   207600
KZ       17.04  2724902

In [8]:
countries_df.loc[['UA', 'BY', 'KZ'],['population', 'area']]

    population     area
UA       45.50   603628
BY        9.50   207600
KZ       17.04  2724902

In [9]:
countries_df.iloc[4:8, 1:3]

    population     area
UA       45.50   603628
BY        9.50   207600
KZ       17.04  2724902

Экспорт в файл

In [10]:
countries_df.to_csv('data/countries.csv', index=False, sep=';')

Чтение с файла

In [11]:
countries_data = pd.read_csv('data/countries.csv', sep=';')
display(countries_data)

     country  population      area
0     Англия       56.29    133396
1     Канада       38.05   9984670
2        США      322.28   9826630
3     Россия      146.24  17125191
4    Украина       45.50    603628
5   Беларусь        9.50    207600
6  Казахстан       17.04   2724902

Экспорт в различные форматы

In [24]:
countries_df.to_excel('data/test.xlsx')

In [27]:
exel_countries_data = pd.read_excel('data/test.xlsx')
display(exel_countries_data)

  Unnamed: 0    country  population      area
0         UK     Англия       56.29    133396
1         CA     Канада       38.05   9984670
2         US        США      322.28   9826630
3         RU     Россия      146.24  17125191
4         UA    Украина       45.50    603628
5         BY   Беларусь        9.50    207600
6         KZ  Казахстан       17.04   2724902